<a href="https://colab.research.google.com/github/justaplan/stack_overflow_survey_analysis/blob/master/stack_overflow_survey.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive

drive.mount("/content/gdrive" , force_remount=True)

%cd "/content/gdrive/My Drive/Python/List of CSV"

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/gdrive
/content/gdrive/My Drive/Python/List of CSV

In [2]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv("survey_results_public.csv", index_col="Respondent")
schema_df = pd.read_csv("survey_results_schema.csv", index_col="Column")

In [4]:
schema_df.index.values

array(['Respondent', 'MainBranch', 'Hobbyist', 'OpenSourcer',
       'OpenSource', 'Employment', 'Country', 'Student', 'EdLevel',
       'UndergradMajor', 'EduOther', 'OrgSize', 'DevType', 'YearsCode',
       'Age1stCode', 'YearsCodePro', 'CareerSat', 'JobSat', 'MgrIdiot',
       'MgrMoney', 'MgrWant', 'JobSeek', 'LastHireDate', 'LastInt',
       'FizzBuzz', 'JobFactors', 'ResumeUpdate', 'CurrencySymbol',
       'CurrencyDesc', 'CompTotal', 'CompFreq', 'ConvertedComp',
       'WorkWeekHrs', 'WorkPlan', 'WorkChallenge', 'WorkRemote',
       'WorkLoc', 'ImpSyn', 'CodeRev', 'CodeRevHrs', 'UnitTests',
       'PurchaseHow', 'PurchaseWhat', 'LanguageWorkedWith',
       'LanguageDesireNextYear', 'DatabaseWorkedWith',
       'DatabaseDesireNextYear', 'PlatformWorkedWith',
       'PlatformDesireNextYear', 'WebFrameWorkedWith',
       'WebFrameDesireNextYear', 'MiscTechWorkedWith',
       'MiscTechDesireNextYear', 'DevEnviron', 'OpSys', 'Containers',
       'BlockchainOrg', 'BlockchainIs', 'BetterLife', 'ITperson', 'OffOn',
       'SocialMedia', 'Extraversion', 'ScreenName', 'SOVisit1st',
       'SOVisitFreq', 'SOVisitTo', 'SOFindAnswer', 'SOTimeSaved',
       'SOHowMuchTime', 'SOAccount', 'SOPartFreq', 'SOJobs', 'EntTeams',
       'SOComm', 'WelcomeChange', 'SONewContent', 'Age', 'Gender',
       'Trans', 'Sexuality', 'Ethnicity', 'Dependents', 'SurveyLength',
       'SurveyEase'], dtype=object)

**<h1>Data Sorting</h1>**

<h3>1. Sort 1 column</h3>

In [28]:
country_sort_df = df.sort_values(by="Country")
country_sort_df["Country"]

Respondent
39258    Afghanistan
63129    Afghanistan
85715    Afghanistan
50767    Afghanistan
2782     Afghanistan
            ...
88062            NaN
88076            NaN
88601            NaN
88802            NaN
88816            NaN
Name: Country, Length: 88883, dtype: object

<h3>2. Sort Multiple Columns with specific arrangment</h3>

In [32]:
multiple_sort_df = df.sort_values(by=["Country","ConvertedComp"],ascending=[True,False])
multiple_sort_df[["Country","ConvertedComp"]]

                Country  ConvertedComp
Respondent
63129       Afghanistan      1000000.0
50499       Afghanistan       153216.0
39258       Afghanistan        19152.0
58450       Afghanistan        17556.0
7085        Afghanistan        14364.0
...                 ...            ...
88062               NaN            NaN
88076               NaN            NaN
88601               NaN            NaN
88802               NaN            NaN
88816               NaN            NaN

[88883 rows x 2 columns]

<h3>3. Get the list of largest value in the Series</h3>

In [33]:
df["ConvertedComp"].nlargest(10)

Respondent
58      2000000.0
102     2000000.0
166     2000000.0
436     2000000.0
452     2000000.0
491     2000000.0
539     2000000.0
770     2000000.0
789     2000000.0
1232    2000000.0
Name: ConvertedComp, dtype: float64

<h3>4. Get the list of smallest value in the Series</h3>

In [34]:
df["ConvertedComp"].nsmallest(10)

Respondent
280     0.0
293     0.0
722     0.0
1105    0.0
1501    0.0
1685    0.0
1782    0.0
2019    0.0
2095    0.0
2665    0.0
Name: ConvertedComp, dtype: float64

**<h1>Data Filtering</h1>**

<h3>1. Filtering Salary with specific amount and indicate which columns you want to see</h3>

In [6]:
filt = df["ConvertedComp"] > 10000
df.loc[filt,["Country","EdLevel","ConvertedComp"]]

                  Country  ... ConvertedComp
Respondent                 ...
4           United States  ...       61000.0
6                  Canada  ...      366420.0
9             New Zealand  ...       95179.0
10                  India  ...       13293.0
13          United States  ...       90000.0
...                   ...  ...           ...
88878       United States  ...      130000.0
88879             Finland  ...       82488.0
88881             Austria  ...       68745.0
88882         Netherlands  ...      588012.0
88883              Greece  ...       22915.0

[50029 rows x 3 columns]

<h3>2. Display the values from columns if contains anything from the list</h3>

In [ ]:
countries = ["United States","India","New Zealand","Malaysia"]
df.loc[df["Country"].isin(countries),["Country"]]

<h3>3. Search Values from the Series which contains List<h3>

In [ ]:
know_python = df["LanguageWorkedWith"].str.contains("Python",na=False) ## Put na as false because some of the row values are NaN
df.loc[know_python]

<h3>4. Multiple Filter Criteria</h3>

In [41]:
multi_filt = (df["Country"] == "Malaysia") & (df["ConvertedComp"] > 1000)
df.loc[multi_filt,["Country","ConvertedComp"]]

             Country  ConvertedComp
Respondent
769         Malaysia        16548.0
786         Malaysia        16116.0
2187        Malaysia        12300.0
2805        Malaysia        19044.0
3720        Malaysia        15379.0
...              ...            ...
82867       Malaysia         9672.0
83609       Malaysia        12300.0
83763       Malaysia         7908.0
84413       Malaysia        18468.0
88365       Malaysia        29293.0

[138 rows x 2 columns]

**<h1>Data Cleaning</h1>**

<h3>Cleaning the data in column YearsCode and calculate the median<h3>

In [19]:
df["YearsCode"].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [23]:
df["YearsCode"].replace("Less than 1 year",0,inplace=True)
df["YearsCode"].replace("More than 50 years",51,inplace=True)
df["YearsCode"] = df["YearsCode"].astype(float)

In [25]:
df["YearsCode"].median()

9.0

**<h1>Aggregation Function</h1>**

In [4]:
# df.describe() All aggreagete from DataFrame
df["ConvertedComp"].describe()

          CompTotal  ConvertedComp   WorkWeekHrs    CodeRevHrs           Age
count  5.594500e+04   5.582300e+04  64503.000000  49790.000000  79210.000000
mean   5.519014e+11   1.271107e+05     42.127197      5.084308     30.336699
std    7.331926e+13   2.841523e+05     37.287610      5.513931      9.178390
min    0.000000e+00   0.000000e+00      1.000000      0.000000      1.000000
25%    2.000000e+04   2.577750e+04     40.000000      2.000000     24.000000
50%    6.200000e+04   5.728700e+04     40.000000      4.000000     29.000000
75%    1.200000e+05   1.000000e+05     44.750000      6.000000     35.000000
max    1.000000e+16   2.000000e+06   4850.000000     99.000000     99.000000

**<h1>Grouping</h1>**

<h3>1. Grouping and Aggregate</h3>

In [19]:
# Group by specific columns
country_grp = df.groupby("Country")

# Advance Functions - Can use aggregate function for specific columns and row
country_describe =  country_grp["ConvertedComp"].describe().loc["Albania"]
albania_mean = country_grp["ConvertedComp"].mean().loc["Albania"]

albania_mean

21833.7

<h3>2. Grouping and Multiple Aggregate Function (No Describe)</h3>

In [21]:
country_grp = df.groupby("Country")

country_grp["ConvertedComp"].agg(["median","mean","min","max"]).loc["Canada"]

median    6.870500e+04
mean      1.340186e+05
min       0.000000e+00
max       2.000000e+06
Name: Canada, dtype: float64

<h3>3. Exercise: To calculate actual percentage people know python based on country</h3>

In [30]:
# Create the necessary series
country_respondents = df["Country"].value_counts()
country_know_python = df.groupby("Country")["LanguageWorkedWith"].apply(lambda x: x.str.contains("Python").sum())

In [44]:
# Combine Series to new DataFrame
python_df = pd.concat([country_respondents,country_know_python], axis="columns",sort=True)
python_df.head()

             Country  LanguageWorkedWith
Afghanistan       44                   8
Albania           86                  23
Algeria          134                  40
Andorra            7                   0
Angola             5                   2

In [45]:
# Raname the column
python_df.rename(columns={"Country": "NumOfRespondents","LanguageWorkedWith": "NumsknewPython"},inplace=True)

In [46]:
python_df.head()

             NumOfRespondents  NumsknewPython
Afghanistan                44               8
Albania                    86              23
Algeria                   134              40
Andorra                     7               0
Angola                      5               2

In [47]:
## Calculate the percentage knew python and add in to brand new column
python_df["PctKnewPython"] = round((python_df["NumsknewPython"] / python_df["NumOfRespondents"]) * 100,2)
python_df.head()

             NumOfRespondents  NumsknewPython  PctKnewPython
Afghanistan                44               8          18.18
Albania                    86              23          26.74
Algeria                   134              40          29.85
Andorra                     7               0           0.00
Angola                      5               2          40.00

In [51]:
## Sort Values
python_df.sort_index(ascending=True)

                                      NumOfRespondents  ...  PctKnewPython
Afghanistan                                         44  ...          18.18
Albania                                             86  ...          26.74
Algeria                                            134  ...          29.85
Andorra                                              7  ...           0.00
Angola                                               5  ...          40.00
...                                                ...  ...            ...
Venezuela, Bolivarian Republic of...                88  ...          31.82
Viet Nam                                           231  ...          33.77
Yemen                                               19  ...          15.79
Zambia                                              12  ...          33.33
Zimbabwe                                            39  ...          35.90

[179 rows x 3 columns]